{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "import rdflib\n",
    "from rdflib.graph import Graph, URIRef\n",
    "from SPARQLWrapper import SPARQLWrapper, XML\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "I might take some time, bear with me...\n",
      "...All done!\n",
      "\n"
     ]
    }
   ],
   "source": [
    "sparql = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "\n",
    "construct_query= \"\"\"\n",
    "PREFIX ma: <http://www.semanticweb.org/dibah/ontologies/2024/3/untitled-ontology-11#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "PREFIX wikibase: <http://wikiba.se/ontology#>\n",
    "PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "\n",
    "CONSTRUCT {\n",
    "    ?book rdf:type ma:Book .\n",
    "    ?book ma:title ?name .\n",
    "    ?book ma:written_by ?author .\n",
    "    ?author rdf:type ma:Author .\n",
    "    ?book ma:published_by ?publisher .\n",
    "    ?publisher rdf:type ma:publisher .\n",
    "    ?book ma:has_genre ?genre .\n",
    "    ?genre rdf:type ma:literaryGenre .\n",
    "    ?book ma:cover_designed_by ?coverArtist .\n",
    "    ?book ma:numberOfPages ?numberOfPages .\n",
    "    ?book ma:isbn ?isbn .\n",
    "    ?book ma:releaseDate ?releaseDate .\n",
    "    ?book ma:has_publish_country ?country .\n",
    "    ?country rdf:type ma:Country .\n",
    "    ?book ma:has_language ?lang .\n",
    "    ?lang rdf:type ma:Language .\n",
    "    ?book ma:has_character ?Character .\n",
    "    ?Character rdf:type ma:Character .      \n",
    "  }\n",
    "WHERE {\n",
    "  ?book wdt:P31 wd:Q571 .\n",
    "  ?book wdt:P1476 ?name .\n",
    "  OPTIONAL { ?book wdt:P407 ?lang .}\n",
    "  OPTIONAL { ?book wdt:P50 ?author . }\n",
    "  OPTIONAL { ?book wdt:P136 ?genre . }\n",
    "  OPTIONAL { ?book wdt:P123 ?publisher . }\n",
    "  ?book wdt:P577 ?releaseDate .\n",
    "  OPTIONAL { ?book wdt:P495 ?Country . }\n",
    "  OPTIONAL { ?book wdt:P736 ?coverArtist . }\n",
    "  OPTIONAL { ?book wdt:P674 ?Character . }\n",
    "\n",
    "  FILTER (LANG(?name) = 'en') .\n",
    "}\"\"\"\n",
    "\n",
    "sparql.setQuery(construct_query)\n",
    "sparql.setReturnFormat(XML)\n",
    "\n",
    "graph_id = URIRef(\"http://www.semanticweb.org/store/book\")\n",
    "g = Graph(identifier=graph_id)\n",
    "\n",
    "print(\"I might take some time, bear with me...\")\n",
    "\n",
    "g = sparql.query().convert()\n",
    "\n",
    "g.parse(\"book_dbpedia.owl\")\n",
    "\n",
    "g.serialize(\"book_bonus.owl\", format=\"xml\")\n",
    "\n",
    "print(\"...All done!\")\n",
    "print(\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'\\nSELECT DISTINCT ?author ?birthdate ?birthplace ?gender WHERE {\\n    BIND(<b> AS ?author).\\n    ?author wdt:P569 ?birthdate .\\n    OPTIONAL { ?author wdt:P19 ?birthplace . }\\n    OPTIONAL { ?author wdt:P21 ?gender . }\\n}\\n'"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "author_query_template = \"\"\"\n",
    "SELECT DISTINCT ?author ?birthdate ?birthplace ?gender WHERE {{\n",
    "    BIND(<{}> AS ?author).\n",
    "    ?author wdt:P569 ?birthdate .\n",
    "    OPTIONAL {{ ?author wdt:P19 ?birthplace . }}\n",
    "    OPTIONAL {{ ?author wdt:P21 ?gender . }}\n",
    "}}\n",
    "\"\"\"\n",
    "author_query_template.format(\"b\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'head': {'vars': ['author', 'birthdate', 'birthplace', 'gender']}, 'results': {'bindings': []}}\n"
     ]
    },
    {
     "ename": "NameError",
     "evalue": "name 'birthdate' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "Cell \u001b[1;32mIn[29], line 36\u001b[0m\n\u001b[0;32m     33\u001b[0m     birthplace \u001b[38;5;241m=\u001b[39m result\u001b[38;5;241m.\u001b[39mget(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mbirthplace\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[0;32m     34\u001b[0m     gender \u001b[38;5;241m=\u001b[39m result\u001b[38;5;241m.\u001b[39mget(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mgender\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[1;32m---> 36\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[43mbirthdate\u001b[49m:\n\u001b[0;32m     37\u001b[0m     g\u001b[38;5;241m.\u001b[39madd((URIRef(author_uri), rdflib\u001b[38;5;241m.\u001b[39mURIRef(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mhttp://www.semanticweb.org/dibah/ontologies/2024/3/untitled-ontology-11#AuthorBirthDate\u001b[39m\u001b[38;5;124m\"\u001b[39m), rdflib\u001b[38;5;241m.\u001b[39mLiteral(birthdate\u001b[38;5;241m.\u001b[39mvalue)))\n\u001b[0;32m     38\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m birthplace:\n",
      "\u001b[1;31mNameError\u001b[0m: name 'birthdate' is not defined"
     ]
    }
   ],
   "source": [
    "import rdflib\n",
    "from rdflib.graph import Graph, URIRef\n",
    "from SPARQLWrapper import SPARQLWrapper, XML, JSON\n",
    "from rdflib.namespace import RDF\n",
    "\n",
    "sparql = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "ma = URIRef(\"http://www.semanticweb.org/dibah/ontologies/2024/3/untitled-ontology-11#\")\n",
    "# Load the existing ontology file\n",
    "g = Graph()\n",
    "g.parse(\"book_dbpedia.owl\")\n",
    "author_query_template = \"\"\"\n",
    "SELECT DISTINCT ?author ?birthdate ?birthplace ?gender WHERE {{\n",
    "    BIND(<{}> AS ?author).\n",
    "    ?author wdt:P569 ?birthdate .\n",
    "    OPTIONAL {{ ?author wdt:P19 ?birthplace . }}\n",
    "    OPTIONAL {{ ?author wdt:P21 ?gender . }}\n",
    "}}\n",
    "\"\"\"\n",
    "author_uris = set()\n",
    "for subject, predicate, obj in g.triples((None, RDF.type, None)):\n",
    "    for s, p, o in g.triples((subject, None, None)):\n",
    "        if str(p).endswith(\"written_by\"):\n",
    "            author_uris.add(str(o))\n",
    "for author_uri in author_uris:\n",
    "    # Construct and execute SPARQL query for each author\n",
    "    author_query = author_query_template.format(author_uri)\n",
    "    sparql.setQuery(author_query)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    author_data = sparql.query().convert()\n",
    "    print(author_data)\n",
    "    for result in author_data['results']['bindings']:\n",
    "        birthdate = result.get(\"birthdate\")\n",
    "        birthplace = result.get(\"birthplace\")\n",
    "        gender = result.get(\"gender\")\n",
    "\n",
    "    if birthdate:\n",
    "        g.add((URIRef(author_uri), rdflib.URIRef(\"http://www.semanticweb.org/dibah/ontologies/2024/3/untitled-ontology-11#AuthorBirthDate\"), rdflib.Literal(birthdate.value)))\n",
    "    if birthplace:\n",
    "        g.add((URIRef(author_uri), rdflib.URIRef(\"http://www.semanticweb.org/dibah/ontologies/2024/3/untitled-ontology-11#AuthorBirthPlace\"), rdflib.URIRef(birthplace.value)))\n",
    "    if gender:\n",
    "        g.add((URIRef(author_uri), rdflib.URIRef(\"http://www.semanticweb.org/dibah/ontologies/2024/3/untitled-ontology-11#AuthorGender\"), rdflib.URIRef(gender.value)))\n",
    "\n",
    "# Serialize the modified graph to OWL format\n",
    "g.serialize(\"book_bonus.owl\", format=\"xml\")\n",
    "\n",
    "print(\"...All done!\")\n",
    "# for author in author_uris:\n",
    "#     print(author)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'http://dbpedia.org/resource/Adrian_Hyland',\n",
       " 'http://dbpedia.org/resource/Alberto_Vázquez-Figueroa',\n",
       " 'http://dbpedia.org/resource/Alex_Haley',\n",
       " 'http://dbpedia.org/resource/Alex_Miller_(writer)',\n",
       " 'http://dbpedia.org/resource/Alice_Borchardt',\n",
       " 'http://dbpedia.org/resource/Amelia_Atwater-Rhodes',\n",
       " 'http://dbpedia.org/resource/Amos_Oz',\n",
       " 'http://dbpedia.org/resource/Amélie_Nothomb',\n",
       " 'http://dbpedia.org/resource/Anaïs_Nin',\n",
       " 'http://dbpedia.org/resource/Andrea_Camilleri',\n",
       " 'http://dbpedia.org/resource/Andreas_Norman',\n",
       " 'http://dbpedia.org/resource/Andrew_Clements',\n",
       " 'http://dbpedia.org/resource/Andrey_Kurkov',\n",
       " 'http://dbpedia.org/resource/Andy_Griffiths_(author)',\n",
       " 'http://dbpedia.org/resource/Anita_Shreve',\n",
       " 'http://dbpedia.org/resource/Ann_M._Martin',\n",
       " 'http://dbpedia.org/resource/Anne_Frank',\n",
       " 'http://dbpedia.org/resource/Anne_Holm',\n",
       " 'http://dbpedia.org/resource/Anne_Rivers_Siddons',\n",
       " 'http://dbpedia.org/resource/Antonella_Gambotto-Burke',\n",
       " 'http://dbpedia.org/resource/Arnon_Grunberg',\n",
       " 'http://dbpedia.org/resource/Augusto_Cury',\n",
       " 'http://dbpedia.org/resource/Ayaan_Hirsi_Ali',\n",
       " 'http://dbpedia.org/resource/Banana_Yoshimoto',\n",
       " 'http://dbpedia.org/resource/Bano_Qudsia',\n",
       " 'http://dbpedia.org/resource/Ben_Aaronovitch',\n",
       " 'http://dbpedia.org/resource/Ben_Jealous',\n",
       " 'http://dbpedia.org/resource/Ben_Lerner',\n",
       " 'http://dbpedia.org/resource/Benedict_Allen',\n",
       " 'http://dbpedia.org/resource/Betsy_Byars',\n",
       " 'http://dbpedia.org/resource/Binod_Bihari_Verma',\n",
       " 'http://dbpedia.org/resource/Boban_Knežević',\n",
       " 'http://dbpedia.org/resource/Bohumil_Hrabal',\n",
       " 'http://dbpedia.org/resource/Boris_Akunin',\n",
       " 'http://dbpedia.org/resource/Boris_Pasternak',\n",
       " 'http://dbpedia.org/resource/Brian_Castro',\n",
       " 'http://dbpedia.org/resource/Brian_Cleeve',\n",
       " 'http://dbpedia.org/resource/Brion_Gysin',\n",
       " 'http://dbpedia.org/resource/Bruce_Campbell',\n",
       " 'http://dbpedia.org/resource/Bruce_Coville',\n",
       " 'http://dbpedia.org/resource/Bryce_Courtenay',\n",
       " 'http://dbpedia.org/resource/C._J._Cherryh',\n",
       " 'http://dbpedia.org/resource/Camilo_José_Cela',\n",
       " 'http://dbpedia.org/resource/Carlos_Fuentes',\n",
       " 'http://dbpedia.org/resource/Carrie_Fisher',\n",
       " 'http://dbpedia.org/resource/Cathy_Scott',\n",
       " 'http://dbpedia.org/resource/Cecily_von_Ziegesar',\n",
       " 'http://dbpedia.org/resource/Charles_Portis',\n",
       " 'http://dbpedia.org/resource/Christine_Feehan',\n",
       " 'http://dbpedia.org/resource/Christopher_Buckley_(novelist)',\n",
       " 'http://dbpedia.org/resource/Christopher_Koch',\n",
       " 'http://dbpedia.org/resource/Christopher_Paolini',\n",
       " 'http://dbpedia.org/resource/Chuck_Palahniuk',\n",
       " 'http://dbpedia.org/resource/Clarice_Lispector',\n",
       " 'http://dbpedia.org/resource/Clive_Cussler',\n",
       " 'http://dbpedia.org/resource/Colleen_McCullough',\n",
       " 'http://dbpedia.org/resource/Connie_Willis',\n",
       " 'http://dbpedia.org/resource/Curt_Sampson',\n",
       " 'http://dbpedia.org/resource/Cynthia_Rylant',\n",
       " 'http://dbpedia.org/resource/Cynthia_Voigt',\n",
       " 'http://dbpedia.org/resource/Cyprian_Ekwensi',\n",
       " 'http://dbpedia.org/resource/D._J._MacHale',\n",
       " 'http://dbpedia.org/resource/DBC_Pierre',\n",
       " 'http://dbpedia.org/resource/Daniel_O._Fagunwa',\n",
       " 'http://dbpedia.org/resource/Dave_Barry',\n",
       " 'http://dbpedia.org/resource/David_Hill_(author)',\n",
       " 'http://dbpedia.org/resource/David_McCullough',\n",
       " 'http://dbpedia.org/resource/David_Weber',\n",
       " 'http://dbpedia.org/resource/David_Wellington_(author)',\n",
       " 'http://dbpedia.org/resource/David_Williamson',\n",
       " 'http://dbpedia.org/resource/Dean_Koontz',\n",
       " 'http://dbpedia.org/resource/Diane_Glancy',\n",
       " 'http://dbpedia.org/resource/Don_DeLillo',\n",
       " 'http://dbpedia.org/resource/Donald_Hamilton',\n",
       " 'http://dbpedia.org/resource/Dorothy_Porter',\n",
       " 'http://dbpedia.org/resource/Douglas_Preston',\n",
       " 'http://dbpedia.org/resource/E._L._Doctorow',\n",
       " 'http://dbpedia.org/resource/E._L._Konigsburg',\n",
       " 'http://dbpedia.org/resource/E._Lynn_Harris',\n",
       " 'http://dbpedia.org/resource/Ed_Husain',\n",
       " 'http://dbpedia.org/resource/Eileen_Chang',\n",
       " 'http://dbpedia.org/resource/Ekaterina_Sedia',\n",
       " 'http://dbpedia.org/resource/Elena_Fortún',\n",
       " 'http://dbpedia.org/resource/Elie_Wiesel',\n",
       " 'http://dbpedia.org/resource/Emily_Giffin',\n",
       " 'http://dbpedia.org/resource/Emmanuelle_Arsan',\n",
       " 'http://dbpedia.org/resource/Eric_Gamalinda',\n",
       " 'http://dbpedia.org/resource/Eric_Walters',\n",
       " 'http://dbpedia.org/resource/F._Sionil_José',\n",
       " 'http://dbpedia.org/resource/Fabrizio_De_André',\n",
       " 'http://dbpedia.org/resource/Fannie_Flagg',\n",
       " 'http://dbpedia.org/resource/Faustino_Aguilar',\n",
       " 'http://dbpedia.org/resource/Favel_Parrett',\n",
       " 'http://dbpedia.org/resource/Flora_Nwapa',\n",
       " 'http://dbpedia.org/resource/Frank_Moorhouse',\n",
       " 'http://dbpedia.org/resource/Frank_Yerby',\n",
       " 'http://dbpedia.org/resource/Franz_Werfel',\n",
       " 'http://dbpedia.org/resource/Friedrich_Hayek',\n",
       " 'http://dbpedia.org/resource/Gabriel_García_Márquez',\n",
       " 'http://dbpedia.org/resource/Gabriel_Okara',\n",
       " 'http://dbpedia.org/resource/Gabrielle_Lord',\n",
       " 'http://dbpedia.org/resource/Garth_Nix',\n",
       " 'http://dbpedia.org/resource/George_Dohrmann',\n",
       " 'http://dbpedia.org/resource/Gerrit_Komrij',\n",
       " 'http://dbpedia.org/resource/Glenda_Adams',\n",
       " 'http://dbpedia.org/resource/Glenn_Beck',\n",
       " 'http://dbpedia.org/resource/Gordon_Ramsay',\n",
       " 'http://dbpedia.org/resource/Greg_Egan',\n",
       " 'http://dbpedia.org/resource/Gustav_Hasford',\n",
       " 'http://dbpedia.org/resource/Günter_Grass',\n",
       " 'http://dbpedia.org/resource/Ha_Jin',\n",
       " 'http://dbpedia.org/resource/Halldór_Laxness',\n",
       " 'http://dbpedia.org/resource/Hamka',\n",
       " 'http://dbpedia.org/resource/Hannes_Bok',\n",
       " 'http://dbpedia.org/resource/Hans_Fallada',\n",
       " 'http://dbpedia.org/resource/Harivansh_Rai_Bachchan',\n",
       " 'http://dbpedia.org/resource/Harold_Coyle',\n",
       " 'http://dbpedia.org/resource/Helen_Garner',\n",
       " 'http://dbpedia.org/resource/Henning_Mankell',\n",
       " 'http://dbpedia.org/resource/Henry_Rollins',\n",
       " 'http://dbpedia.org/resource/Hermann_Huppen',\n",
       " 'http://dbpedia.org/resource/Hilda_Bernstein',\n",
       " 'http://dbpedia.org/resource/Hjalmar_Söderberg',\n",
       " 'http://dbpedia.org/resource/Howard_Fast',\n",
       " 'http://dbpedia.org/resource/Hugo_Claus',\n",
       " 'http://dbpedia.org/resource/Humayun_Azad',\n",
       " 'http://dbpedia.org/resource/Ildefonso_Falcones',\n",
       " 'http://dbpedia.org/resource/Ivan_Yefremov',\n",
       " 'http://dbpedia.org/resource/J._M._Coetzee',\n",
       " 'http://dbpedia.org/resource/J._S._Lewis',\n",
       " 'http://dbpedia.org/resource/Jack_Kerouac',\n",
       " 'http://dbpedia.org/resource/Jamaica_Kincaid',\n",
       " 'http://dbpedia.org/resource/James_P._Hogan_(writer)',\n",
       " 'http://dbpedia.org/resource/James_Patterson',\n",
       " 'http://dbpedia.org/resource/Jan_Křesadlo',\n",
       " 'http://dbpedia.org/resource/Janet_Evanovich',\n",
       " 'http://dbpedia.org/resource/Janet_Fitch',\n",
       " 'http://dbpedia.org/resource/Janet_Lunn',\n",
       " \"http://dbpedia.org/resource/Jean_D'Costa\",\n",
       " 'http://dbpedia.org/resource/Jean_M._Auel',\n",
       " 'http://dbpedia.org/resource/Jennifer_Roberson',\n",
       " 'http://dbpedia.org/resource/Jia_Yinghua',\n",
       " 'http://dbpedia.org/resource/Jimmy_Breslin',\n",
       " 'http://dbpedia.org/resource/Joan_London_(Australian_author)',\n",
       " 'http://dbpedia.org/resource/Johann_Hari',\n",
       " 'http://dbpedia.org/resource/Johanna_Sinisalo',\n",
       " 'http://dbpedia.org/resource/John_Dale_(writer)',\n",
       " 'http://dbpedia.org/resource/John_Grisham',\n",
       " 'http://dbpedia.org/resource/John_Varley_(author)',\n",
       " 'http://dbpedia.org/resource/Jon_McGregor',\n",
       " 'http://dbpedia.org/resource/Jonathan_Carroll',\n",
       " 'http://dbpedia.org/resource/Jonathan_Franzen',\n",
       " 'http://dbpedia.org/resource/Jonathan_Lethem',\n",
       " 'http://dbpedia.org/resource/Jorge_Amado',\n",
       " 'http://dbpedia.org/resource/Joseph_Brodsky',\n",
       " 'http://dbpedia.org/resource/Josué_Guébo',\n",
       " 'http://dbpedia.org/resource/José_Saramago',\n",
       " 'http://dbpedia.org/resource/José_de_Alencar',\n",
       " 'http://dbpedia.org/resource/Judith_Krantz',\n",
       " 'http://dbpedia.org/resource/Judy_Blume',\n",
       " 'http://dbpedia.org/resource/Julia_Cameron',\n",
       " 'http://dbpedia.org/resource/Julie_Andrews',\n",
       " 'http://dbpedia.org/resource/Kaari_Utrio',\n",
       " 'http://dbpedia.org/resource/Kage_Baker',\n",
       " 'http://dbpedia.org/resource/Kalki_Krishnamurthy',\n",
       " 'http://dbpedia.org/resource/Karen_Blixen',\n",
       " 'http://dbpedia.org/resource/Kate_DiCamillo',\n",
       " 'http://dbpedia.org/resource/Kate_Grenville',\n",
       " 'http://dbpedia.org/resource/Kathy_Reichs',\n",
       " 'http://dbpedia.org/resource/Keizan',\n",
       " 'http://dbpedia.org/resource/Kel_Robertson',\n",
       " 'http://dbpedia.org/resource/Kelley_Armstrong',\n",
       " 'http://dbpedia.org/resource/Ken_Russell',\n",
       " 'http://dbpedia.org/resource/Kenneth_Benton',\n",
       " 'http://dbpedia.org/resource/Kevin_Boyle_(historian)',\n",
       " 'http://dbpedia.org/resource/Khushwant_Singh',\n",
       " 'http://dbpedia.org/resource/Knut_Hamsun',\n",
       " 'http://dbpedia.org/resource/Kovid_Gupta',\n",
       " 'http://dbpedia.org/resource/Krishan_Kumar_Sharma_%22Rasik%22',\n",
       " 'http://dbpedia.org/resource/L._Sprague_de_Camp',\n",
       " 'http://dbpedia.org/resource/Landry_Walker',\n",
       " 'http://dbpedia.org/resource/Larry_Niven',\n",
       " 'http://dbpedia.org/resource/Laurell_K._Hamilton',\n",
       " 'http://dbpedia.org/resource/Len_Deighton',\n",
       " 'http://dbpedia.org/resource/Lily_Brett',\n",
       " 'http://dbpedia.org/resource/Lin_Carter',\n",
       " 'http://dbpedia.org/resource/Lois_McMaster_Bujold',\n",
       " \"http://dbpedia.org/resource/Louis_L'Amour\",\n",
       " 'http://dbpedia.org/resource/Louis_Nowra',\n",
       " 'http://dbpedia.org/resource/Lualhati_Bautista',\n",
       " 'http://dbpedia.org/resource/Lynn_Flewelling',\n",
       " 'http://dbpedia.org/resource/Lynne_Cheney',\n",
       " 'http://dbpedia.org/resource/M._A._Numminen',\n",
       " \"http://dbpedia.org/resource/Madeleine_L'Engle\",\n",
       " 'http://dbpedia.org/resource/Maeve_Binchy',\n",
       " 'http://dbpedia.org/resource/Manny_Aston',\n",
       " 'http://dbpedia.org/resource/Marga_T',\n",
       " 'http://dbpedia.org/resource/Marguerite_Duras',\n",
       " 'http://dbpedia.org/resource/Marilynne_Robinson',\n",
       " 'http://dbpedia.org/resource/Mario_Vargas_Llosa',\n",
       " 'http://dbpedia.org/resource/Marion_Zimmer_Bradley',\n",
       " 'http://dbpedia.org/resource/Mark_Sable',\n",
       " 'http://dbpedia.org/resource/Mary_Kirchoff',\n",
       " 'http://dbpedia.org/resource/Matthew_Reilly',\n",
       " 'http://dbpedia.org/resource/Max_Frisch',\n",
       " 'http://dbpedia.org/resource/Meja_Mwangi',\n",
       " 'http://dbpedia.org/resource/Mia_Couto',\n",
       " 'http://dbpedia.org/resource/Michael_Buckley_(author)',\n",
       " 'http://dbpedia.org/resource/Michael_Moorcock',\n",
       " 'http://dbpedia.org/resource/Michael_Ondaatje',\n",
       " 'http://dbpedia.org/resource/Michael_Scott_(Irish_author)',\n",
       " 'http://dbpedia.org/resource/Michalina_Wisłocka',\n",
       " 'http://dbpedia.org/resource/Miguel_M._Abrahão',\n",
       " 'http://dbpedia.org/resource/Miho_Mosulishvili',\n",
       " 'http://dbpedia.org/resource/Mikael_Niemi',\n",
       " 'http://dbpedia.org/resource/Mildred_D._Taylor',\n",
       " 'http://dbpedia.org/resource/Miriam_Defensor_Santiago',\n",
       " 'http://dbpedia.org/resource/Mo_Yan',\n",
       " 'http://dbpedia.org/resource/Moyra_Caldecott',\n",
       " 'http://dbpedia.org/resource/Naguib_Mahfouz',\n",
       " 'http://dbpedia.org/resource/Nancy_Holder',\n",
       " 'http://dbpedia.org/resource/Neil_Gaiman',\n",
       " 'http://dbpedia.org/resource/Neil_Jordan',\n",
       " 'http://dbpedia.org/resource/Neil_M._Gunn',\n",
       " 'http://dbpedia.org/resource/Nelson_DeMille',\n",
       " 'http://dbpedia.org/resource/Newt_Gingrich',\n",
       " 'http://dbpedia.org/resource/Nick_Bostrom',\n",
       " 'http://dbpedia.org/resource/Nina_Antonia',\n",
       " 'http://dbpedia.org/resource/Nina_Simone',\n",
       " 'http://dbpedia.org/resource/Nora_Roberts',\n",
       " 'http://dbpedia.org/resource/Orhan_Pamuk',\n",
       " 'http://dbpedia.org/resource/Pat_Conroy',\n",
       " 'http://dbpedia.org/resource/Patricia_Cornwell',\n",
       " 'http://dbpedia.org/resource/Patricia_Highsmith',\n",
       " 'http://dbpedia.org/resource/Patrick_White',\n",
       " 'http://dbpedia.org/resource/Paul_Auster',\n",
       " 'http://dbpedia.org/resource/Paulo_Coelho',\n",
       " 'http://dbpedia.org/resource/Penelope_Lively',\n",
       " 'http://dbpedia.org/resource/Peter_Carey_(novelist)',\n",
       " 'http://dbpedia.org/resource/Peter_S._Beagle',\n",
       " 'http://dbpedia.org/resource/Philip_K._Dick',\n",
       " 'http://dbpedia.org/resource/Philip_Kerr',\n",
       " 'http://dbpedia.org/resource/Philip_Roth',\n",
       " 'http://dbpedia.org/resource/Phyllis_Reynolds_Naylor',\n",
       " 'http://dbpedia.org/resource/Poul_Anderson',\n",
       " 'http://dbpedia.org/resource/R._K._Narayan',\n",
       " 'http://dbpedia.org/resource/Rahul_Sankrityayan',\n",
       " 'http://dbpedia.org/resource/Ramalho_Ortigão',\n",
       " 'http://dbpedia.org/resource/Raul_Pompeia',\n",
       " 'http://dbpedia.org/resource/Ray_Bradbury',\n",
       " 'http://dbpedia.org/resource/Raymond_Chandler',\n",
       " 'http://dbpedia.org/resource/Rex_Stout',\n",
       " 'http://dbpedia.org/resource/Richard_Flanagan',\n",
       " 'http://dbpedia.org/resource/Richard_Matheson',\n",
       " 'http://dbpedia.org/resource/Rita_Dove',\n",
       " 'http://dbpedia.org/resource/Rob_Thomas_(writer)',\n",
       " 'http://dbpedia.org/resource/Robert_B._Parker',\n",
       " 'http://dbpedia.org/resource/Robert_Goldsborough_(writer)',\n",
       " 'http://dbpedia.org/resource/Robert_Jordan',\n",
       " 'http://dbpedia.org/resource/Robert_M._Pirsig',\n",
       " 'http://dbpedia.org/resource/Robert_Sobel',\n",
       " 'http://dbpedia.org/resource/Robert_Westall',\n",
       " 'http://dbpedia.org/resource/Roger_McDonald',\n",
       " 'http://dbpedia.org/resource/Roger_Zelazny',\n",
       " 'http://dbpedia.org/resource/Rohinton_Mistry',\n",
       " 'http://dbpedia.org/resource/Ronald_Kessler',\n",
       " 'http://dbpedia.org/resource/Ronald_McKie',\n",
       " 'http://dbpedia.org/resource/Rudolf_Diesel',\n",
       " 'http://dbpedia.org/resource/Ruta_Sepetys',\n",
       " 'http://dbpedia.org/resource/Ruth_Park',\n",
       " 'http://dbpedia.org/resource/Ruth_Rendell',\n",
       " 'http://dbpedia.org/resource/Rutu_Modan',\n",
       " 'http://dbpedia.org/resource/S._L._Bhyrappa',\n",
       " 'http://dbpedia.org/resource/Sadeq_Chubak',\n",
       " 'http://dbpedia.org/resource/Sakyo_Komatsu',\n",
       " 'http://dbpedia.org/resource/Sam_Harris',\n",
       " 'http://dbpedia.org/resource/Samuel_R._Delany',\n",
       " 'http://dbpedia.org/resource/Sara_Douglass',\n",
       " 'http://dbpedia.org/resource/Sariamin_Ismail',\n",
       " 'http://dbpedia.org/resource/Sayyid_Qutb',\n",
       " 'http://dbpedia.org/resource/Sergei_Aman',\n",
       " 'http://dbpedia.org/resource/Sergei_Lukyanenko',\n",
       " 'http://dbpedia.org/resource/Stanisław_Lem',\n",
       " 'http://dbpedia.org/resource/Stephan_Collishaw',\n",
       " 'http://dbpedia.org/resource/Steven_Brust',\n",
       " 'http://dbpedia.org/resource/Steven_Erikson',\n",
       " 'http://dbpedia.org/resource/Susan_Olsen',\n",
       " 'http://dbpedia.org/resource/Søren_Kierkegaard',\n",
       " 'http://dbpedia.org/resource/T._A._Barron',\n",
       " 'http://dbpedia.org/resource/T._J._Bass',\n",
       " 'http://dbpedia.org/resource/Tabitha_King',\n",
       " 'http://dbpedia.org/resource/Tad_Williams',\n",
       " 'http://dbpedia.org/resource/Tami_Hoag',\n",
       " 'http://dbpedia.org/resource/Terry_Goodkind',\n",
       " 'http://dbpedia.org/resource/Thomas_Bernhard',\n",
       " 'http://dbpedia.org/resource/Thomas_E._Ricks_(journalist)',\n",
       " 'http://dbpedia.org/resource/Thomas_Keneally',\n",
       " 'http://dbpedia.org/resource/Thornton_Wilder',\n",
       " 'http://dbpedia.org/resource/Thrity_Umrigar',\n",
       " 'http://dbpedia.org/resource/Tim_Kring',\n",
       " 'http://dbpedia.org/resource/Tim_Winton',\n",
       " 'http://dbpedia.org/resource/Timothy_Findley',\n",
       " 'http://dbpedia.org/resource/Timothy_Mo',\n",
       " 'http://dbpedia.org/resource/Toni_Morrison',\n",
       " 'http://dbpedia.org/resource/Tony_Hendra',\n",
       " 'http://dbpedia.org/resource/Uroob',\n",
       " 'http://dbpedia.org/resource/Uta_Frith',\n",
       " 'http://dbpedia.org/resource/V._C._Andrews',\n",
       " 'http://dbpedia.org/resource/Vanessa_Duriès',\n",
       " 'http://dbpedia.org/resource/Vasily_Grossman',\n",
       " 'http://dbpedia.org/resource/Vincent_Cronin',\n",
       " 'http://dbpedia.org/resource/Walter_Moers',\n",
       " 'http://dbpedia.org/resource/Whitley_Strieber',\n",
       " 'http://dbpedia.org/resource/William_Faulkner',\n",
       " 'http://dbpedia.org/resource/William_Least_Heat-Moon',\n",
       " 'http://dbpedia.org/resource/William_T._Vollmann',\n",
       " 'http://dbpedia.org/resource/William_Trevor',\n",
       " 'http://dbpedia.org/resource/Witold_Gombrowicz',\n",
       " 'http://dbpedia.org/resource/Xavier_Herbert',\n",
       " 'http://dbpedia.org/resource/Yukio_Mishima',\n",
       " 'http://dbpedia.org/resource/Yulia_Latynina',\n",
       " 'http://dbpedia.org/resource/Zakes_Mda',\n",
       " 'http://dbpedia.org/resource/Zakhar_Prilepin',\n",
       " 'http://dbpedia.org/resource/Zane_Grey',\n",
       " 'http://dbpedia.org/resource/Zilpha_Keatley_Snyder',\n",
       " 'http://dbpedia.org/resource/Álex_de_la_Iglesia',\n",
       " 'http://dbpedia.org/resource/Åsa_Larsson'}"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "author_uris"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "  I might take some time, bear with  me...\n",
      "done with bluh\n",
      "<xml.dom.minidom.Document object at 0x0000021AE9185670>\n"
     ]
    },
    {
     "ename": "TypeError",
     "evalue": "'Document' object is not iterable",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mTypeError\u001b[0m                                 Traceback (most recent call last)",
      "Cell \u001b[1;32mIn[22], line 121\u001b[0m\n\u001b[0;32m    119\u001b[0m \u001b[38;5;28mprint\u001b[39m(author_data)\n\u001b[0;32m    120\u001b[0m \u001b[38;5;66;03m# Iterate through the query results and update the ontology\u001b[39;00m\n\u001b[1;32m--> 121\u001b[0m \u001b[38;5;28;01mfor\u001b[39;00m result \u001b[38;5;129;01min\u001b[39;00m \u001b[43m(\u001b[49m\u001b[38;5;28;43mdict\u001b[39;49m\u001b[43m(\u001b[49m\u001b[43mrow\u001b[49m\u001b[43m)\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43;01mfor\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[43mrow\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;129;43;01min\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[43mauthor_data\u001b[49m\u001b[43m)\u001b[49m:\n\u001b[0;32m    122\u001b[0m     author_uri \u001b[38;5;241m=\u001b[39m result[\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mauthor\u001b[39m\u001b[38;5;124m\"\u001b[39m]\u001b[38;5;241m.\u001b[39mvalue\n\u001b[0;32m    123\u001b[0m     birthdate \u001b[38;5;241m=\u001b[39m result\u001b[38;5;241m.\u001b[39mget(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mbirthdate\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n",
      "\u001b[1;31mTypeError\u001b[0m: 'Document' object is not iterable"
     ]
    }
   ],
   "source": [
    "import rdflib\n",
    "from rdflib.graph import Graph, URIRef\n",
    "from SPARQLWrapper import SPARQLWrapper, XML\n",
    "\n",
    "# Configuring the end-point and constructing query.\n",
    "# Notice the various SPARQL constructs we are making use of:\n",
    "#\n",
    "#   * PREFIX to bind prefixes in our query\n",
    "#   * CONSTRUCT to build new individuals from our query\n",
    "#   * OPTIONAL to indicate that some fields may not exist and that's OK\n",
    "#   * FILTER to constrain our query in some way\n",
    "#\n",
    "\n",
    "sparql = SPARQLWrapper(\"http://dbpedia.org/sparql\")\n",
    "construct_query=\"\"\"PREFIX ma: <http://www.semanticweb.org/dibah/ontologies/2024/3/untitled-ontology-11#>\n",
    "    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>        \n",
    "    PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "    PREFIX dbpedia-owl: <http://dbpedia.org/ontology/>\n",
    "    PREFIX dbpprop: <http://dbpedia.org/property/>\n",
    "    PREFIX dbp: <http://dbpedia.org/property/>\n",
    "\n",
    "    CONSTRUCT {\n",
    "    ?book rdf:type ma:Book .\n",
    "    ?book rdfs:label ?name .\n",
    "    ?book ma:title ?name .\n",
    "    ?book ma:written_by ?author .\n",
    "    ?author rdf:type ma:Author .\n",
    "    ?author rdfs:label ?Nauthor .\n",
    "    ?book ma:published_by ?publisher .\n",
    "    ?publisher rdf:type ma:publisher .\n",
    "    ?book ma:has_genre ?genre .\n",
    "    ?genre rdf:type ma:literaryGenre .\n",
    "    ?book ma:cover_designed_by ?coverArtist .\n",
    "    ?coverArtist rdf:type ma:coverArtist .\n",
    "    ?coverArtist rdfs:label ?NcoverArtist .\n",
    "    ?book ma:numberOfPages ?numberOfPages .\n",
    "    ?book ma:isbn ?isbn .\n",
    "    ?book ma:releaseDate ?releaseDate .\n",
    "    ?book ma:has_publish_country ?country .\n",
    "    ?country rdf:type ma:Country .\n",
    "    ?book ma:has_language ?lang .\n",
    "    ?lang rdf:type ma:Language .\n",
    "    ?book ma:has_character ?Character .\n",
    "    ?Character rdf:type ma:Character .        \n",
    "    \n",
    "    }\n",
    "    WHERE{\n",
    "        ?book rdf:type dbpedia-owl:Book .\n",
    "\n",
    "        ?book dbp:name ?name .\n",
    "        FILTER(!REGEX(?name, \"Book\", \"i\"))\n",
    "        ?book dbpedia-owl:author ?author .\n",
    "        ?author dbp:birthName ?Nauthor .\n",
    "        OPTIONAL {?book dbpedia-owl:genre ?genre}\n",
    "        OPTIONAL {?book dbpedia-owl:publisher ?publisher}\n",
    "        OPTIONAL {?book dbpedia-owl:coverArtist ?coverArtist .\n",
    "        ?coverArtist dbp:name ?NcoverArtist}\n",
    "        OPTIONAL {?book dbpedia-owl:numberOfPages ?numberOfPages}\n",
    "        ?book dbpedia-owl:isbn ?isbn .\n",
    "        FILTER(?isbn != \"\") . # Ensure ISBN is not an empty string\n",
    "        ?book dbp:releaseDate ?releaseDate .\n",
    "        OPTIONAL {?book dbpedia-owl:country ?country}\n",
    "        OPTIONAL {?book dbpedia-owl:language ?lang}\n",
    "        OPTIONAL {?book dbpedia-owl:Character ?Character}\n",
    "\n",
    "        FILTER(?country != ?lang) # Ensure country and language are different\n",
    "        FILTER(LANG(?name)='en')\n",
    "        }\n",
    "    LIMIT 1000\n",
    "    \"\"\"\n",
    "\n",
    "sparql.setQuery(construct_query)\n",
    "sparql.setReturnFormat(XML)\n",
    "\n",
    "# Creating the RDF store and graph\n",
    "# We've seen something similar in the lab sheets before, Week 3. We're telling\n",
    "# the rdflib library to create a new graph and store it in memory (so, temporarily).\n",
    "\n",
    "graph_id = URIRef(\"http://www.semanticweb.org/store/book\")\n",
    "g = Graph(identifier = graph_id)\n",
    "\n",
    "# SPARQL queries can take some time to run, especially if the query is particularly\n",
    "# large and you're grabbing very many items. \n",
    "#\n",
    "# While experimenting you may want to use the LIMIT construct in SPARQL to take\n",
    "# only a couple of items, this way you can experiment with things without waiting\n",
    "# ages for a query to complete.\n",
    "print(\"  I might take some time, bear with  me...\")\n",
    "\n",
    "# merging results and saving the store\n",
    "# The Week 4 lab showed us this, so we know that running the query will return a\n",
    "# valid RDFlib graph.\n",
    "g = sparql.query().convert()\n",
    "\n",
    "# We also saw in Week 3 that we can parse files as valid RDFlib graphs too. When\n",
    "# we do both of these things, they will be merged together.\n",
    "g.parse(\"book.owl\")\n",
    "\n",
    "# You can open this file in protege and compare it to the existing `movie.owl`\n",
    "# ontology to see what we did. You could also open this in a text editor and have\n",
    "# a poke around that way.\n",
    "author_query_template = \"\"\"\n",
    "    PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "    \n",
    "    SELECT DISTINCT ?author ?birthdate ?birthplace ?gender WHERE {\n",
    "    ?author a <http://www.semanticweb.org/dibah/ontologies/2024/3/untitled-ontology-11#Author> .\n",
    "    ?author wdt:P569 ?birthdate .\n",
    "    OPTIONAL { ?author wdt:P19 ?birthplace . }\n",
    "    OPTIONAL { ?author wdt:P21 ?gender . }\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "# Execute SPARQL query to retrieve data about authors\n",
    "sparql.setQuery(author_query_template)\n",
    "sparql.setReturnFormat(XML)\n",
    "author_data = sparql.query().convert()\n",
    "g.serialize(\"bluh.owl\", format=\"xml\")\n",
    "print(\"done with bluh\")\n",
    "print(author_data)\n",
    "# Iterate through the query results and update the ontology\n",
    "for result in (dict(row) for row in author_data):\n",
    "    author_uri = result[\"author\"].value\n",
    "    birthdate = result.get(\"birthdate\")\n",
    "    birthplace = result.get(\"birthplace\")\n",
    "    gender = result.get(\"gender\")\n",
    "\n",
    "    if birthdate:\n",
    "        g.add((URIRef(author_uri), rdflib.URIRef(\"http://www.semanticweb.org/dibah/ontologies/2024/3/untitled-ontology-11#AuthorBirthDate\"), rdflib.Literal(birthdate.value)))\n",
    "    if birthplace:\n",
    "        g.add((URIRef(author_uri), rdflib.URIRef(\"http://www.semanticweb.org/dibah/ontologies/2024/3/untitled-ontology-11#AuthorBirthPlace\"), rdflib.URIRef(birthplace.value)))\n",
    "    if gender:\n",
    "        g.add((URIRef(author_uri), rdflib.URIRef(\"http://www.semanticweb.org/dibah/ontologies/2024/3/untitled-ontology-11#AuthorGender\"), rdflib.URIRef(gender.value)))\n",
    "\n",
    "# Serialize the modified graph to OWL format\n",
    "g.serialize(\"book_bonus.owl\", format=\"xml\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "set()"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import rdflib\n",
    "from rdflib.graph import Graph, URIRef\n",
    "from SPARQLWrapper import SPARQLWrapper, XML\n",
    "\n",
    "# Configuring the end-point and constructing query.\n",
    "# Notice the various SPARQL constructs we are making use of:\n",
    "#\n",
    "#   * PREFIX to bind prefixes in our query\n",
    "#   * CONSTRUCT to build new individuals from our query\n",
    "#   * OPTIONAL to indicate that some fields may not exist and that's OK\n",
    "#   * FILTER to constrain our query in some way\n",
    "#\n",
    "\n",
    "sparql = SPARQLWrapper(\"http://dbpedia.org/sparql\")\n",
    "\n",
    "graph_id = URIRef(\"http://www.semanticweb.org/store/book\")\n",
    "g = Graph(identifier=graph_id)\n",
    "g.parse(\"book_dbpedia.owl\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=N53fe5171fdcf470e953d00c1e67cadfd (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from rdflib import Graph, URIRef, Literal, Namespace\n",
    "\n",
    "# Create a new RDF graph\n",
    "g = Graph()\n",
    "\n",
    "# Define namespaces for your ontology\n",
    "ma = Namespace(\"http://www.semanticweb.org/dibah/ontologies/2024/3/untitled-ontology-11#\")\n",
    "\n",
    "# Define subjects and objects\n",
    "book_uri = URIRef(\"http://example.com/book1\")\n",
    "author_uri = URIRef(\"http://example.com/author1\")\n",
    "title_literal = Literal(\"Sample Book Title\")\n",
    "author_name_literal = Literal(\"John Doe\")\n",
    "# Add triples to the graph\n",
    "g.add((book_uri, ma.hasTitle, title_literal))  # Add a title property to the book\n",
    "g.add((book_uri, ma.hasAuthor, author_uri))    # Add an author property to the book\n",
    "g.add((author_uri, ma.hasName, author_name_literal))  # Add a name property to the author\n",
    "\n",
    "# Serialize the graph to an RDF/XML file\n",
    "g.serialize(\"ontology.owl\", format=\"xml\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
